Revit 2027 API
SymbolTypeId.SlopeDegree Property
 Symbol °, indicating unit Slope degrees.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SlopeDegree { get; }
Public Shared ReadOnly Property SlopeDegree As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SlopeDegree {
	ForgeTypeId^ get ();
}
static member SlopeDegree : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SymbolTypeId Class
Autodesk.Revit.DB Namespace